# 1
# def f1():
#     a = 10
#     print (a)
#     print(id(a))

#     def f2():
#         print(a)
#         print(id(a))
#     print (f2())
    
        


# print (f1())
#print (f2())

# 2
#a = (1,2,3,[1,2,3],4)

#a[0] = 2 - no
#a[3].append(10) -
#print (a[3])

# 3
	
# Напишите программу на Python, которая выполняет итерацию целых чисел от 1 до 50.
# Для чисел, кратных трем, выведите «Fizz» вместо числа, а для кратных пяти выведите «Buzz». 
# Для чисел, которые кратны как трем, так и пяти выведите «FizzBuzz»

# организуем цикл, в коттором будет инкремент переменной i
# делаем проверку кратноости 3, если TRUE print ('Fizz')
# делаем проверку кратноости 5, если TRUE print ('Buzz')
# делаем проверку кратноости 3,5, если TRUE print ('FizzBuzz')

# i=0
# while i <= 50:
#     print (i)
#     if (i %3 == 0)  (i %5 > 0):
#         print ('Fizz')
#     if i %5 == 0:
#         print ('Buzz')
#     if (i %3 == 0) & (i %5 == 0):
#         print ('FizzBuzz')
#     i= i+1

i=1
while i <= 50:
    if i %3 == 0 and i %5 == 0:
        print ('FizzBuzz')
    elif i %3 == 0:
        print ('Fizz')
    elif i %5 == 0:
        print ('Buzz')
    else:
        print(i)
    i += 1
    
    
# dеfault     nexthop 10.0.0.3 
# 10.0.2.0/16    nexthop 10.0.0.1
# 10.0.2.128.0/25    nexthop 10.0.0.2
# 10.0.0.10/24  direct net
# Как он обработает пакет с dst IP: 10.0.2.179 ?



# 3.Таблица маршрутизации роутера:
# Prefix           Type      Nexthop
# ----------------------------------
# 0.0.0.0/0        nexthop   10.0.0.3 
# 10.0.0.0/16      nexthop   10.0.0.1
# 10.0.0.0/24       direct   eth1.10
# 10.0.2.0/24      nexthop   10.0.0.2

# Как маршрутизатор обработает пакет с dst IP: 10.0.2.179 ?